Final/Supersonic/A1/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 80;

boundaryField
{
   
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 80;
    }

   front    
    {
        type            empty;	
    }

   back    
    {
        type            empty;	
    }

    top    
    {
        type            zeroGradient;	
    }
     

    bottom    
    {
        type            zeroGradient;	
    }

    wall
    {
        type           zeroGradient;
    }



}

// ************************************************************************* //
